## Plan for main
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 10 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sns_topic.critical will be created
  + resource "aws_sns_topic" "critical" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "critical-issue"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # aws_sns_topic.warning will be created
  + resource "aws_sns_topic" "warning" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "warning-issue"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # module.alarm_actions.aws_cloudwatch_log_metric_filter.user_alarm_failure["Ops1"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_failure" {
      + id             = (known after apply)
      + log_group_name = "aws-controltower/CloudTrailLogs"
      + name           = "Ops1_ConsoleLogin_Failure"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"Ops1\" && $.responseElements.ConsoleLogin = \"Failure\" }"

      + metric_transformation {
          + name      = "Ops1_ConsoleLogin_Failure"
          + namespace = "common-metrics"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.alarm_actions.aws_cloudwatch_log_metric_filter.user_alarm_failure["Ops2"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_failure" {
      + id             = (known after apply)
      + log_group_name = "aws-controltower/CloudTrailLogs"
      + name           = "Ops2_ConsoleLogin_Failure"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"Ops2\" && $.responseElements.ConsoleLogin = \"Failure\" }"

      + metric_transformation {
          + name      = "Ops2_ConsoleLogin_Failure"
          + namespace = "common-metrics"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.alarm_actions.aws_cloudwatch_log_metric_filter.user_alarm_success["Ops1"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_success" {
      + id             = (known after apply)
      + log_group_name = "aws-controltower/CloudTrailLogs"
      + name           = "Ops1_ConsoleLogin_Success"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"Ops1\" && $.responseElements.ConsoleLogin = \"Success\" }"

      + metric_transformation {
          + name      = "Ops1_ConsoleLogin_Success"
          + namespace = "common-metrics"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.alarm_actions.aws_cloudwatch_log_metric_filter.user_alarm_success["Ops2"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_success" {
      + id             = (known after apply)
      + log_group_name = "aws-controltower/CloudTrailLogs"
      + name           = "Ops2_ConsoleLogin_Success"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"Ops2\" && $.responseElements.ConsoleLogin = \"Success\" }"

      + metric_transformation {
          + name      = "Ops2_ConsoleLogin_Success"
          + namespace = "common-metrics"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure["Ops1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_failure" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "Ops1_ConsoleLogin_Failure_alarm_failure"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Ops1_ConsoleLogin_Failure"
      + namespace                             = "common-metrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 2
      + treat_missing_data                    = "notBreaching"
    }

  # module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure["Ops2"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_failure" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "Ops2_ConsoleLogin_Failure_alarm_failure"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Ops2_ConsoleLogin_Failure"
      + namespace                             = "common-metrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 2
      + treat_missing_data                    = "notBreaching"
    }

  # module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success["Ops1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_success" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "Ops1_ConsoleLogin_Success_alarm_success"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Ops1_ConsoleLogin_Success"
      + namespace                             = "common-metrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success["Ops2"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_success" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "Ops2_ConsoleLogin_Success_alarm_success"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Ops2_ConsoleLogin_Success"
      + namespace                             = "common-metrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

15 tests, 8 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
